m/crystal/uni_notes/alsd.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-11-01 Wed 20:17 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>ALSD1</title>
<meta name="author" content="Crystal" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../src/css/colors.css"/>
<link rel="stylesheet" type="text/css" href="../src/css/style.css"/>
<link rel="icon" type="image/x-icon" href="https://crystal.tilde.institute/favicon.png">
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../../../uni_notes/"> UP </a>
 |
 <a accesskey="H" href="https://crystal.tilde.institute/"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">ALSD1</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org99d5220">Contenu de la Matiére</a>
<ul>
<li><a href="#orgbd002d7">Chapitre 1: Elements de Base</a></li>
<li><a href="#orgeb962fb">Chapitre 2: Présentation du formalisme Algorithmique</a></li>
<li><a href="#org7a1fb51">Chapitre 3: Eléments de base du language C</a></li>
<li><a href="#org5f789aa">Chapitre 4: Modularité( Fonction et Procédure )</a></li>
<li><a href="#org330830d">Chapitre 5: Les structures des données statiques</a></li>
</ul>
</li>
<li><a href="#orgced3d78">Premier cours : Algorithmes <i>Oct 1</i> :</a>
<ul>
<li><a href="#orga9ff303">Définition d&rsquo;un algorithm :</a>
<ul>
<li><a href="#org38de9fd">Example d&rsquo;un Algo : Résolution d&rsquo;une équation du second ordre (ax²+bx+c=0)</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org99d5220" class="outline-2">
<h2 id="org99d5220">Contenu de la Matiére</h2>
<div class="outline-text-2" id="text-org99d5220">
</div>
<div id="outline-container-orgbd002d7" class="outline-3">
<h3 id="orgbd002d7">Chapitre 1: Elements de Base</h3>
<div class="outline-text-3" id="text-orgbd002d7">
<ul class="org-ul">
<li>Algorithmique, procésseur, action.<br /></li>
<li>Programme et languages de programmation.<br /></li>
<li>Analyse des problémes.<br /></li>
</ul>
</div>
</div>
<div id="outline-container-orgeb962fb" class="outline-3">
<h3 id="orgeb962fb">Chapitre 2: Présentation du formalisme Algorithmique</h3>
</div>
<div id="outline-container-org7a1fb51" class="outline-3">
<h3 id="org7a1fb51">Chapitre 3: Eléments de base du language C</h3>
</div>
<div id="outline-container-org5f789aa" class="outline-3">
<h3 id="org5f789aa">Chapitre 4: Modularité( Fonction et Procédure )</h3>
</div>
<div id="outline-container-org330830d" class="outline-3">
<h3 id="org330830d">Chapitre 5: Les structures des données statiques</h3>
</div>
</div>
<div id="outline-container-orgced3d78" class="outline-2">
<h2 id="orgced3d78">Premier cours : Algorithmes <i>Oct 1</i> :</h2>
<div class="outline-text-2" id="text-orgced3d78">
</div>
<div id="outline-container-orga9ff303" class="outline-3">
<h3 id="orga9ff303">Définition d&rsquo;un algorithm :</h3>
<div class="outline-text-3" id="text-orga9ff303">
<p>
Un ensemble d&rsquo;opérations ecrites dans le language naturel.<br />
</p>
</div>
<div id="outline-container-org38de9fd" class="outline-4">
<h4 id="org38de9fd">Example d&rsquo;un Algo : Résolution d&rsquo;une équation du second ordre (ax²+bx+c=0)</h4>
<div class="outline-text-4" id="text-org38de9fd">
<ol class="org-ol">
<li>Si a=0 ET b=0 alors <b>l&rsquo;équation n&rsquo;est pas du 2nd ordre</b>.<br /></li>
<li>Si a=0 et b≠0 alors <b>x= -c/5</b> .<br /></li>
<li>Si a≠0 alors <b>calculer Δ= b²-4ac</b> :<br />
<ol class="org-ol">
<li>Si Δ=0 alors <b>x=-b/2a</b>.<br /></li>
<li>Si Δ&lt;0 alors <b>l&rsquo;équation n&rsquo;as pas de solution</b>.<br /></li>
<li>Si Δ&gt;0 alors <b>x=[-b±sqrt(Δ)]/2a</b><br /></li>
</ol></li>
</ol>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Crystal</p>
<p class="date">Created: 2023-11-01 Wed 20:17</p>
</div>
</body>
</html>